trol73/avr-make/asm/include/ATxmega384D3def.inc
.equ TCD2_CTRLA = 2304		// Control Register A
.equ TCD2_CTRLB = 2305		// Control Register B
.equ TCD2_CTRLC = 2306		// Control register C
.equ TCD2_CTRLE = 2308		// Control Register E
.equ TCD2_INTCTRLA = 2310		// Interrupt Control Register A
.equ TCD2_INTCTRLB = 2311		// Interrupt Control Register B
.equ TCD2_CTRLF = 2313		// Control Register F
.equ TCD2_INTFLAGS = 2316		// Interrupt Flag Register
.equ TCD2_LCNT = 2336		// Low Byte Count
.equ TCD2_HCNT = 2337		// High Byte Count
.equ TCD2_LPER = 2342		// Low Byte Period
.equ TCD2_HPER = 2343		// High Byte Period
.equ TCD2_LCMPA = 2344		// Low Byte Compare A
.equ TCD2_HCMPA = 2345		// High Byte Compare A
.equ TCD2_LCMPB = 2346		// Low Byte Compare B
.equ TCD2_HCMPB = 2347		// High Byte Compare B
.equ TCD2_LCMPC = 2348		// Low Byte Compare C
.equ TCD2_HCMPC = 2349		// High Byte Compare C
.equ TCD2_LCMPD = 2350		// Low Byte Compare D
.equ TCD2_HCMPD = 2351		// High Byte Compare D

;***************************************************************************
;** USARTD0 - Universal Asynchronous Receiver-Transmitter D0
;***************************************************************************
	
.equ USARTD0_DATA = 2464		// Data Register
.equ USARTD0_STATUS = 2465		// Status Register
.equ USARTD0_CTRLA = 2467		// Control Register A
.equ USARTD0_CTRLB = 2468		// Control Register B
.equ USARTD0_CTRLC = 2469		// Control Register C
.equ USARTD0_BAUDCTRLA = 2470		// Baud Rate Control Register A
.equ USARTD0_BAUDCTRLB = 2471		// Baud Rate Control Register B

;***************************************************************************
;** SPID - Serial Peripheral Interface D
;***************************************************************************
	
.equ SPID_CTRL = 2496		// Control Register
.equ SPID_INTCTRL = 2497		// Interrupt Control Register
.equ SPID_STATUS = 2498		// Status Register
.equ SPID_DATA = 2499		// Data Register

;***************************************************************************
;** TCE0 - Timer/Counter E0
;***************************************************************************
	
.equ TCE0_CTRLA = 2560		// Control  Register A
.equ TCE0_CTRLB = 2561		// Control Register B
.equ TCE0_CTRLC = 2562		// Control register C
.equ TCE0_CTRLD = 2563		// Control Register D
.equ TCE0_CTRLE = 2564		// Control Register E
.equ TCE0_INTCTRLA = 2566		// Interrupt Control Register A
.equ TCE0_INTCTRLB = 2567		// Interrupt Control Register B
.equ TCE0_CTRLFCLR = 2568		// Control Register F Clear
.equ TCE0_CTRLFSET = 2569		// Control Register F Set
.equ TCE0_CTRLGCLR = 2570		// Control Register G Clear
.equ TCE0_CTRLGSET = 2571		// Control Register G Set
.equ TCE0_INTFLAGS = 2572		// Interrupt Flag Register
.equ TCE0_TEMP = 2575		// Temporary Register For 16-bit Access
.equ TCE0_CNT = 2592		// Count
.equ TCE0_PER = 2598		// Period
.equ TCE0_CCA = 2600		// Compare or Capture A
.equ TCE0_CCB = 2602		// Compare or Capture B
.equ TCE0_CCC = 2604		// Compare or Capture C
.equ TCE0_CCD = 2606		// Compare or Capture D
.equ TCE0_PERBUF = 2614		// Period Buffer
.equ TCE0_CCABUF = 2616		// Compare Or Capture A Buffer
.equ TCE0_CCBBUF = 2618		// Compare Or Capture B Buffer
.equ TCE0_CCCBUF = 2620		// Compare Or Capture C Buffer
.equ TCE0_CCDBUF = 2622		// Compare Or Capture D Buffer

;***************************************************************************
;** TCE2 - Timer/Counter E2
;***************************************************************************
	
.equ TCE2_CTRLA = 2560		// Control Register A
.equ TCE2_CTRLB = 2561		// Control Register B
.equ TCE2_CTRLC = 2562		// Control register C
.equ TCE2_CTRLE = 2564		// Control Register E
.equ TCE2_INTCTRLA = 2566		// Interrupt Control Register A
.equ TCE2_INTCTRLB = 2567		// Interrupt Control Register B
.equ TCE2_CTRLF = 2569		// Control Register F
.equ TCE2_INTFLAGS = 2572		// Interrupt Flag Register
.equ TCE2_LCNT = 2592		// Low Byte Count
.equ TCE2_HCNT = 2593		// High Byte Count
.equ TCE2_LPER = 2598		// Low Byte Period
.equ TCE2_HPER = 2599		// High Byte Period
.equ TCE2_LCMPA = 2600		// Low Byte Compare A
.equ TCE2_HCMPA = 2601		// High Byte Compare A
.equ TCE2_LCMPB = 2602		// Low Byte Compare B
.equ TCE2_HCMPB = 2603		// High Byte Compare B
.equ TCE2_LCMPC = 2604		// Low Byte Compare C
.equ TCE2_HCMPC = 2605		// High Byte Compare C
.equ TCE2_LCMPD = 2606		// Low Byte Compare D
.equ TCE2_HCMPD = 2607		// High Byte Compare D

;***************************************************************************
;** USARTE0 - Universal Asynchronous Receiver-Transmitter E0
;***************************************************************************
	
.equ USARTE0_DATA = 2720		// Data Register
.equ USARTE0_STATUS = 2721		// Status Register
.equ USARTE0_CTRLA = 2723		// Control Register A
.equ USARTE0_CTRLB = 2724		// Control Register B
.equ USARTE0_CTRLC = 2725		// Control Register C
.equ USARTE0_BAUDCTRLA = 2726		// Baud Rate Control Register A
.equ USARTE0_BAUDCTRLB = 2727		// Baud Rate Control Register B

;***************************************************************************
;** TCF0 - Timer/Counter F0
;***************************************************************************
	
.equ TCF0_CTRLA = 2816		// Control  Register A
.equ TCF0_CTRLB = 2817		// Control Register B
.equ TCF0_CTRLC = 2818		// Control register C
.equ TCF0_CTRLD = 2819		// Control Register D
.equ TCF0_CTRLE = 2820		// Control Register E
.equ TCF0_INTCTRLA = 2822		// Interrupt Control Register A
.equ TCF0_INTCTRLB = 2823		// Interrupt Control Register B
.equ TCF0_CTRLFCLR = 2824		// Control Register F Clear
.equ TCF0_CTRLFSET = 2825		// Control Register F Set
.equ TCF0_CTRLGCLR = 2826		// Control Register G Clear
.equ TCF0_CTRLGSET = 2827		// Control Register G Set
.equ TCF0_INTFLAGS = 2828		// Interrupt Flag Register
.equ TCF0_TEMP = 2831		// Temporary Register For 16-bit Access
.equ TCF0_CNT = 2848		// Count
.equ TCF0_PER = 2854		// Period
.equ TCF0_CCA = 2856		// Compare or Capture A
.equ TCF0_CCB = 2858		// Compare or Capture B
.equ TCF0_CCC = 2860		// Compare or Capture C
.equ TCF0_CCD = 2862		// Compare or Capture D
.equ TCF0_PERBUF = 2870		// Period Buffer
.equ TCF0_CCABUF = 2872		// Compare Or Capture A Buffer
.equ TCF0_CCBBUF = 2874		// Compare Or Capture B Buffer
.equ TCF0_CCCBUF = 2876		// Compare Or Capture C Buffer
.equ TCF0_CCDBUF = 2878		// Compare Or Capture D Buffer

;***************************************************************************
;** TCF2 - Timer/Counter F2
;***************************************************************************
	
